Repository: antohal2/maclm_agent
Catalog: maclm-agent/Localizable.xcstrings
Source language: en
Languages: ru

# Ошибка: %@
source: Error: %@
ru: Ошибка: %@

source: Folder %@ includes shell and startup configurations. Writing to them without approval for every call is dangerous. A caution permission for a tool can be remembered for this entire scope.
ru: Папка %@ включает конфигурации оболочки и автозапуска. Запись в них без подтверждения каждый раз опасна. Разрешение caution на инструмент можно будет запомнить для всей этой области.

# Правило: %@
source: Rule: %@
ru: Правило: %@

# Причина уровня: %@
source: Risk reason: %@
ru: Причина уровня: %@

# Результат: %@
source: Result: %@
ru: Результат: %@

# Текст из буфера: %@
source: Clipboard text: %@
ru: Текст из буфера: %@

# Убрать %@ из разрешённых директорий
source: Remove %@ from allowed directories
ru: Убрать %@ из разрешённых директорий

# Разрешено: %@
source: Allowed: %@
ru: Разрешено: %@

# Запрещено: %@
source: Blocked: %@
ru: Запрещено: %@

# Перевести
source: Translate
ru: Перевести

# Улучшить текст
source: Improve text
ru: Улучшить текст

# Саммари
source: Summarize
ru: Саммари

# Объяснить
source: Explain
ru: Объяснить

# Формальный тон
source: Formal tone
ru: Формальный тон

# Неформальный тон
source: Informal tone
ru: Неформальный тон

# системные файлы
source: system files
ru: системные файлы

# системная библиотека
source: system library
ru: системная библиотека

# системные внутренности, включая /etc, /var и /tmp
source: system internals, including /etc, /var and /tmp
ru: системные внутренности, включая /etc, /var и /tmp

# системные бинарники
source: system binaries
ru: системные бинарники

# системные библиотеки
source: system libraries
ru: системные библиотеки

# системные вспомогательные программы
source: system helper programs
ru: системные вспомогательные программы

# системные ресурсы
source: system resources
ru: системные ресурсы

# связки ключей
source: keychains
ru: связки ключей

# приватные ключи
source: private keys
ru: приватные ключи

# облачные креденшелы
source: cloud credentials
ru: облачные креденшелы

# файлы с секретами
source: secret files
ru: файлы с секретами

# конфигурация Git может содержать токены
source: Git configuration may contain tokens
ru: конфигурация Git может содержать токены

# У действия пустой шаблон промпта.
source: The action has an empty prompt template.
ru: У действия пустой шаблон промпта.

# В шаблоне действия отсутствует {{input}}.
source: The action template is missing {{input}}.
ru: В шаблоне действия отсутствует {{input}}.

# LLM-сервер вернул пустой ответ.
source: The LLM server returned an empty response.
ru: LLM-сервер вернул пустой ответ.

# LLM попыталась вызвать инструмент вместо обработки текста.
source: The LLM attempted a tool call instead of processing text.
ru: LLM попыталась вызвать инструмент вместо обработки текста.

# Паттерн не должен быть пустым.
source: Pattern must not be empty.
ru: Паттерн не должен быть пустым.

# Недопустимый нулевой символ.
source: Invalid null character.
ru: Недопустимый нулевой символ.

# Нужен bundle ID в обратной доменной записи: com.example.app.
source: Use a reverse-domain bundle ID: com.example.app.
ru: Нужен bundle ID в обратной доменной записи: com.example.app.

# Нужен hostname или домен с wildcard: example.com, *.example.com.
source: Use a hostname or wildcard domain: example.com, *.example.com.
ru: Нужен hostname или домен с wildcard: example.com, *.example.com.

source: Only *, ** and ? are supported. Classes [], groups {} and escaping are not supported.
ru: Поддерживаются только *, ** и ?. Классы [], группы {} и экранирование не поддерживаются.

# Используйте * или **, не ***.
source: Use * or **, not ***.
ru: Используйте * или **, не ***.

# Встроенные правила нельзя удалить; отключите переключателем.
source: Built-in rules cannot be deleted; disable them using the switch.
ru: Встроенные правила нельзя удалить; отключите переключателем.

# Ошибка regex: %@. %@
source: Regex error: %@. %@
ru: Ошибка regex: %@. %@

# Позиция UTF-16: %lld.
source: UTF-16 position: %lld.
ru: Позиция UTF-16: %lld.

# «%@»: обработка…
source: “%@”: processing…
ru: «%@»: обработка…

# «%@»: результат в буфере. Авто-вставка не выполнена: %@
source: “%@”: result copied. Automatic paste failed: %@
ru: «%@»: результат в буфере. Авто-вставка не выполнена: %@

# «%@»: результат в буфере. Вставьте его вручную через ⌘V.
source: “%@”: result copied. Paste it manually with ⌘V.
ru: «%@»: результат в буфере. Вставьте его вручную через ⌘V.

# «%@»: результат в буфере. Для авто-вставки нужен доступ
source: “%@”: result copied. Automatic paste requires
ru: «%@»: результат в буфере. Для авто-вставки нужен доступ

# «%@»: результат в буфере. Не удалось вернуть фокус — вставьте
source: “%@”: result copied. Could not restore focus — paste
ru: «%@»: результат в буфере. Не удалось вернуть фокус — вставьте

# «%@»: результат вставлен.
source: “%@”: result pasted.
ru: «%@»: результат вставлен.

# Встроенное действие «%@» будет удалено.
source: Built-in action “%@” will be deleted.
ru: Встроенное действие «%@» будет удалено.

# Действие «%@» будет удалено без возможности отмены.
source: Action “%@” will be permanently deleted.
ru: Действие «%@» будет удалено без возможности отмены.

# Комбинация занята, выберите другую (код %d).
source: Shortcut unavailable; choose another (code %d).
ru: Комбинация занята, выберите другую (код %d).

# Не удалось создать событие вставки.
source: Could not create a paste event.
ru: Не удалось создать событие вставки.

# Нет доступа к Универсальному доступу.
source: Accessibility access is unavailable.
ru: Нет доступа к Универсальному доступу.

# Позиция UTF-16: %d.
source: UTF-16 position: %d.
ru: Позиция UTF-16: %d.

# Экспортировано записей: %lld
source: Exported entries: %lld
ru: Экспортировано записей: %lld

# путь вне разрешённых директорий
source: path outside allowed directories
ru: путь вне разрешённых директорий

# путь содержит wildcard
source: path contains a wildcard
ru: путь содержит wildcard

# путь указывает на директорию
source: path points to a directory
ru: путь указывает на директорию

# Не найден (%@)
source: Not found (%@)
ru: Не найден (%@)

# Открыть журнал аудита…
source: Open audit log…
ru: Открыть журнал аудита…

# Выбор модели применяется сразу и используется во всех беседах.
source: Model selection takes effect immediately and is used in all conversations.
ru: Выбор модели применяется сразу и используется во всех беседах.

# %lld мс
source: %lld ms
ru: %lld мс

# Проекты
source: Projects
ru: Проекты

# Чаты
source: Chats
ru: Чаты

# Новый проект…
source: New Project…
ru: Новый проект…

# Новый проект
source: New Project
ru: Новый проект

# Настройки проекта
source: Project Settings
ru: Настройки проекта

# Новая сессия
source: New Session
ru: Новая сессия

# Настройки проекта…
source: Project Settings…
ru: Настройки проекта…

# Новый чат
source: New Chat
ru: Новый чат

# Показать архив
source: Show Archive
ru: Показать архив

# Переименовать
source: Rename
ru: Переименовать

# Удалить проект?
source: Delete Project?
ru: Удалить проект?

# Сессии проекта
source: Project Sessions
ru: Сессии проекта

# Перенести сессии в «Чаты»
source: Move Sessions to Chats
ru: Перенести сессии в «Чаты»

# Удалить вместе с сессиями
source: Delete with Sessions
ru: Удалить вместе с сессиями

# Генерация и ожидание подтверждения будут остановлены.
source: Generation and pending approvals will be stopped.
ru: Генерация и ожидание подтверждения будут остановлены.

# Открепить
source: Unpin
ru: Открепить

# Закрепить
source: Pin
ru: Закрепить

# Переместить в проект
source: Move to Project
ru: Переместить в проект

# Без проекта
source: No Project
ru: Без проекта

# Разархивировать
source: Unarchive
ru: Разархивировать

# Архивировать
source: Archive
ru: Архивировать

# Рабочая папка (необязательно)
source: Working Folder (optional)
ru: Рабочая папка (необязательно)

# Выбрать папку…
source: Choose Folder…
ru: Выбрать папку…

# Инструкции проекта
source: Project Instructions
ru: Инструкции проекта

# Подтвердите рабочую папку
source: Confirm Working Folder
ru: Подтвердите рабочую папку

# Использовать папку
source: Use Folder
ru: Использовать папку

# Вы выбрали домашнюю или системную папку целиком. Подтвердите выбор.
source: You selected the entire home or system folder. Confirm this choice.
ru: Вы выбрали домашнюю или системную папку целиком. Подтвердите выбор.

# Укажите абсолютный путь к папке.
source: Enter an absolute folder path.
ru: Укажите абсолютный путь к папке.

# Корневая папка запрещена.
source: The root folder is not allowed.
ru: Корневая папка запрещена.

# Папка не существует или путь указывает на файл.
source: The folder does not exist or the path points to a file.
ru: Папка не существует или путь указывает на файл.

# Генерация ответа
source: Generating response
ru: Генерация ответа

# Выполняется инструмент: %@
source: Running tool: %@
ru: Выполняется инструмент: %@

# Нужно подтверждение
source: Approval required
ru: Нужно подтверждение

# Ошибка сессии
source: Session failed
ru: Ошибка сессии

# Непрочитанный результат
source: Unread result
ru: Непрочитанный результат

# Уведомления
source: Notifications
ru: Уведомления

# О завершении сессии
source: On session completion
ru: О завершении сессии

# О запросе подтверждения
source: On approval request
ru: О запросе подтверждения

# Разрешить уведомления…
source: Allow notifications…
ru: Разрешить уведомления…

# Нужно подтверждение: %@
source: Approval required: %@
ru: Нужно подтверждение: %@

# Защитное правило нельзя изменить или отключить.
source: Protection rules cannot be changed or disabled.
ru: Защитное правило нельзя изменить или отключить.

# Защита данных и конфигурации приложения
source: Application data and configuration protection
ru: Защита данных и конфигурации приложения

# Разрешённая зона: %@
source: Allowed zone: %@
ru: Разрешённая зона: %@

# Действующих block-правил: %lld
source: Active block rules: %lld
ru: Действующих block-правил: %lld

source: The perimeter and rules apply to file tools. Reads outside the zone are restricted only by block rules. run_shell bypasses the perimeter: read the command on its confirmation card.
ru: Периметр и правила действуют на файловые инструменты. Чтение вне зоны ограничивают только block-правила. run_shell не ограничен периметром: читайте команду на карточке подтверждения.

# Отозвать
source: Revoke
ru: Отозвать

# Сбросить все
source: Reset all
ru: Сбросить все

# Рабочая папка не задана
source: No working directory
ru: Рабочая папка не задана

# Переместить в проект…
source: Move to project…
ru: Переместить в проект…

# Нет проектов
source: No projects
ru: Нет проектов

# Безопасность сессии
source: Session security
ru: Безопасность сессии

# Аудит
source: Audit
ru: Аудит

# Ещё %lld
source: %lld more
ru: Ещё %lld

# Инспектор
source: Inspector
ru: Инспектор

# Глобально
source: Global
ru: Глобально

# Область правил
source: Rule scope
ru: Область правил

# Глобальные
source: Global
ru: Глобальные

# Фильтр беседы: %@
source: Conversation filter: %@
ru: Фильтр беседы: %@

# Глобальные правила
source: Global rules
ru: Глобальные правила

# Изменить папку…
source: Change directory…
ru: Изменить папку…

# Файлы
source: Files
ru: Файлы

# Показать в Finder
source: Show in Finder
ru: Показать в Finder

# Проект
source: Project
ru: Проект

# Не удалось запустить приложение
source: Unable to start the application
ru: Не удалось запустить приложение

# Не удалось открыть хранилище или обеспечить защиту данных: %@
source: Unable to open the store or protect application data: %@
ru: Не удалось открыть хранилище или обеспечить защиту данных: %@

source: allowed_dirs apply only to conversations without a project perimeter. Projects with a working directory use that directory and their own allow rules.
ru: allowed_dirs действуют только в беседах без проектного периметра. В проекте с рабочей папкой используются папка проекта и его allow-правила.

# — ветка
source: — branch
ru: — ветка

# Повторить
source: Retry
ru: Повторить

# Ветка
source: Branch
ru: Ветка

source: Replies after this message will be deleted. File actions already performed are not undone
ru: Ответы после этого сообщения будут удалены. Уже выполненные действия с файлами не отменяются

# Развёрнуто
source: Expanded
ru: Развёрнуто

# Свёрнуто
source: Collapsed
ru: Свёрнуто

# Отклонено
source: Rejected
ru: Отклонено

# Заблокировано правилом
source: Blocked by rule
ru: Заблокировано правилом

# Одобрено dangerous
source: Dangerous approved
ru: Одобрено dangerous

# Ошибка инструмента
source: Tool error
ru: Ошибка инструмента

# Ждёт подтверждения
source: Waiting for approval
ru: Ждёт подтверждения

# Генерация
source: Generating
ru: Генерация

# Показать всё
source: Show all
ru: Показать всё

# Безопасно · safe
source: Safe · safe
ru: Безопасно · safe

# Работает: %@ · %@
source: Working: %1$@ · %2$@
ru: Работает: %@ · %@

# Работа: %@ · %lld шагов
source: Work: %1$@ · %2$lld steps
ru: Работа: %@ · %lld шагов

# Ошибка: %@ · %lld шагов
source: Error: %1$@ · %2$lld steps
ru: Ошибка: %@ · %lld шагов

# Остановлено: %@ · %lld шагов
source: Stopped: %1$@ · %2$lld steps
ru: Остановлено: %@ · %lld шагов

# Код выхода
source: Exit code
ru: Код выхода

# Таймаут
source: Timeout
ru: Таймаут

# Файл изменился после показа превью, повторите действие
source: The file changed after the preview was shown. Retry the action.
ru: Файл изменился после показа превью, повторите действие

# Превышен лимит размера чекпоинта
source: Checkpoint size limit exceeded
ru: Превышен лимит размера чекпоинта

# Недостаточно свободного места для чекпоинта
source: Insufficient free space for a checkpoint
ru: Недостаточно свободного места для чекпоинта

# Нет прав на чтение объекта
source: No permission to read the object
ru: Нет прав на чтение объекта

# Путь запрещён правилами безопасности
source: Path blocked by security rules
ru: Путь запрещён правилами безопасности

# Нарушена целостность чекпоинта
source: Checkpoint integrity check failed
ru: Нарушена целостность чекпоинта

# Превью недоступно
source: Preview unavailable
ru: Превью недоступно

# Откат уже выполняется
source: A restore is already running
ru: Откат уже выполняется

# Не удалось сохранить чекпоинт; инструмент не выполнен
source: Unable to save the checkpoint; the tool was not executed
ru: Не удалось сохранить чекпоинт; инструмент не выполнен

# Можно будет откатить
source: Can be restored
ru: Можно будет откатить

# Без возможности отката: %@
source: Cannot be restored: %@
ru: Без возможности отката: %@

# Новый файл
source: New file
ru: Новый файл

# Файл в месте назначения будет перезаписан
source: The destination file will be overwritten
ru: Файл в месте назначения будет перезаписан

# Размер: %@ → %@
source: Size: %@ → %@
ru: Размер: %@ → %@

# Каталог
source: Directory
ru: Каталог

# Файл
source: File
ru: Файл

# Элементов: %lld
source: Items: %lld
ru: Элементов: %lld

# Нет чекпоинтов
source: No checkpoints
ru: Нет чекпоинтов

# Восстановлен
source: Restored
ru: Восстановлен

# Сохранён
source: Saved
ru: Сохранён

# Откатить…
source: Restore…
ru: Откатить…

# Чекпоинты не заменяют Git и резервные копии
source: Checkpoints do not replace Git or backups
ru: Чекпоинты не заменяют Git и резервные копии

# Изменения команд run_shell чекпоинтами не покрываются
source: Changes made by run_shell commands are not covered by checkpoints
ru: Изменения команд run_shell чекпоинтами не покрываются

# Откатить чекпоинт?
source: Restore checkpoint?
ru: Откатить чекпоинт?

# Откатить
source: Restore
ru: Откатить

# Файлы изменились после операции. Текущие изменения будут заменены.
source: Files have changed since the operation. Current changes will be replaced.
ru: Файлы изменились после операции. Текущие изменения будут заменены.

# Сначала будет сохранён снимок текущего состояния.
source: A snapshot of the current state will be saved first.
ru: Сначала будет сохранён снимок текущего состояния.

# Перезаписать
source: Overwrite
ru: Перезаписать

# Чекпоинты
source: Checkpoints
ru: Чекпоинты

# Лимит объёма: %lld ГБ
source: Volume limit: %lld GB
ru: Лимит объёма: %lld ГБ

# Срок хранения: %lld дней
source: Retention: %lld days
ru: Срок хранения: %lld дней

# Текущий объём: %@
source: Current usage: %@
ru: Текущий объём: %@

# Очистить все чекпоинты…
source: Clear all checkpoints…
ru: Очистить все чекпоинты…

# Очистить все чекпоинты?
source: Clear all checkpoints?
ru: Очистить все чекпоинты?

# Сохранённые копии будут удалены. Активные чекпоинты сохраняются.
source: Saved copies will be deleted. Active checkpoints are retained.
ru: Сохранённые копии будут удалены. Активные чекпоинты сохраняются.

# Объект можно восстановить из Корзины вручную
source: You can manually recover the object from Trash
ru: Объект можно восстановить из Корзины вручную

# Символическая ссылка
source: Symbolic link
ru: Символическая ссылка

# Размер: %@
source: Size: %@
ru: Размер: %@

# Действие пользователя
source: User initiated
ru: Действие пользователя

# По умолчанию
source: Default
ru: По умолчанию

# Не найден
source: Not found
ru: Не найден

# Настройки моделей…
source: Model settings…
ru: Настройки моделей…

# Контекст:
source: Context:
ru: Контекст:

# Инструменты недоступны для этой модели
source: Tools are unavailable for this model
ru: Инструменты недоступны для этой модели

source: Context is almost full — start a new session or branch from the desired response
ru: Контекст почти заполнен — начните новую сессию или сделайте ветку от нужного ответа

# Фактический лимит неизвестен; используется настройка по умолчанию.
source: Actual context limit is unknown; using the default setting.
ru: Фактический лимит неизвестен; используется настройка по умолчанию.

# Максимум модели:
source: Model maximum:
ru: Максимум модели:

# Лимит контекста по умолчанию
source: Default context limit
ru: Лимит контекста по умолчанию

# Модель по умолчанию используется в беседах без собственного выбора.
source: The default model is used in conversations without an explicit selection.
ru: Модель по умолчанию используется в беседах без собственного выбора.

# Назначение существует: файл будет перезаписан
source: Destination exists: the file will be overwritten
ru: Назначение существует: файл будет перезаписан

# exitCode: %lld · timedOut: %@
source: exitCode: %1$lld · timedOut: %2$@
ru: exitCode: %lld · timedOut: %@

# Копировать
source: Copy
ru: Копировать

# Свернуть
source: Collapse
ru: Свернуть

# Питомец
source: Pet
ru: Питомец

# Показать питомца
source: Show pet
ru: Показать питомца

# Спрятать питомца
source: Hide pet
ru: Спрятать питомца

# Включить питомца
source: Enable pet
ru: Включить питомца

# Размер питомца
source: Pet size
ru: Размер питомца

# Вернуть в угол экрана
source: Return to screen corner
ru: Вернуть в угол экрана

# Питомец: ожидание
source: Pet: idle
ru: Питомец: ожидание

# Питомец: генерация ответа
source: Pet: generating response
ru: Питомец: генерация ответа

# Питомец: выполняется инструмент
source: Pet: tool running
ru: Питомец: выполняется инструмент

# Питомец: нужно подтверждение
source: Pet: approval required
ru: Питомец: нужно подтверждение

# Питомец: результат готов
source: Pet: result ready
ru: Питомец: результат готов

# Питомец: ошибка
source: Pet: failed
ru: Питомец: ошибка

# Питомец: перетаскивание
source: Pet: dragging
ru: Питомец: перетаскивание

# Питомец: сон
source: Pet: sleeping
ru: Питомец: сон

# Манифест питомца превышает 64 КБ
source: Pet manifest exceeds 64 KB
ru: Манифест питомца превышает 64 КБ

# Некорректный JSON питомца или неизвестное состояние
source: Invalid pet JSON or unknown state
ru: Некорректный JSON питомца или неизвестное состояние

# Версия питомца должна быть 1
source: Pet version must be 1
ru: Версия питомца должна быть 1

# Некорректный идентификатор питомца
source: Invalid pet identifier
ru: Некорректный идентификатор питомца

# Имя питомца должно содержать от 1 до 40 символов
source: Pet name must contain 1 to 40 characters
ru: Имя питомца должно содержать от 1 до 40 символов

# Размер кадра питомца должен быть 64
source: Pet frame size must be 64
ru: Размер кадра питомца должен быть 64

# Число столбцов питомца должно быть от 1 до 16
source: Pet columns must be between 1 and 16
ru: Число столбцов питомца должно быть от 1 до 16

# Состояния питомца повторяются
source: Duplicate pet states
ru: Состояния питомца повторяются

# Строки питомца повторяются
source: Duplicate pet rows
ru: Строки питомца повторяются

# У питомца отсутствует состояние idle
source: Pet is missing the idle state
ru: У питомца отсутствует состояние idle

# Некорректный индекс строки питомца
source: Invalid pet row index
ru: Некорректный индекс строки питомца

# Число кадров питомца выходит за пределы столбцов
source: Pet frame count exceeds columns
ru: Число кадров питомца выходит за пределы столбцов

# Частота кадров питомца должна быть от 1 до 30
source: Pet frame rate must be between 1 and 30
ru: Частота кадров питомца должна быть от 1 до 30

# Статичный кадр питомца отсутствует в одной из строк
source: Pet reduced motion frame is missing in a row
ru: Статичный кадр питомца отсутствует в одной из строк

# Спрайт питомца превышает 8 МБ
source: Pet sprite exceeds 8 MB
ru: Спрайт питомца превышает 8 МБ

# Спрайт питомца должен быть PNG по содержимому
source: Pet sprite content must be PNG
ru: Спрайт питомца должен быть PNG по содержимому

# Размеры спрайта питомца не соответствуют манифесту
source: Pet sprite dimensions do not match the manifest
ru: Размеры спрайта питомца не соответствуют манифесту

# Не удалось декодировать кадры питомца
source: Could not decode pet frames
ru: Не удалось декодировать кадры питомца
